pub/programming.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Spencer A. Hill   <span style="color: gray"> Postdoc</span> UCLA AOS &amp; Caltech GPS</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Spencer Hill" />
<link rel="stylesheet"
                       href="./css/style.css" type="text/css"/>
</head>
<body>
<div id="content">
<h1 class="title">Spencer A. Hill   <span style="color: gray"> Postdoc</span> UCLA AOS &amp; Caltech GPS</h1>
<p>
<hr/><span style="font-size:1em;color:gray"> <a href="index.html">Home</a> <a href="research.html">Research</a> <a href="publications.html">Publications</a> <a href="cv.html">CV</a> <a href="resources.html">Resources</a> <a href="programming.html">Programming</a> <a href="personal.html">About Me</a> </span><hr/>
<span style="font-size:2em"> Programming </span><hr/>
</p>
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Python</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
I am an avid user of the <a href="https://www.python.org/">Python</a> programming language, which is modern, powerful,
elegant, open-source, and well-documented.  I use the <a href="http://ipython.org/">IPython</a> environment and
rely on the <a href="http://xarray.pydata.org">xarray</a>, <a href="http://www.numpy.org/">NumPy</a>, <a href="http://scipy.org/">SciPy</a>, and <a href="http://matplotlib.org/">matplotlib</a> modules to analyze climate
model data via the free <a href="https://store.continuum.io/cshop/anaconda/">Anaconda</a> distribution.
</p>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="todo p">p</span> angeo-data project</h3>
<div class="outline-text-3" id="text-orgheadline2">
<p>
There is a growing discrepancy between the scale of data that is generated by
climate models and observational products and the capability of tools commonly
used by scientists to analyze that data.  Fortunately, the <a href="http://dask.pydata.org/en/latest/">dask</a> Python package
enables parallel computations on a single node and works with <code>xarray</code> largely
with little effort by the user.  For multi-node computing environments,
<a href="https://distributed.readthedocs.io/en/latest/">dask.distributed</a> provides the same functionality across nodes, and it is
actively being developed to work with data represented via <code>xarray</code> to provide
similarly user-friendly computations on climate data that is parallelized across
multiple nodes.
</p>

<p>
<a href="https://www.github.com/pangeo-data">pangeo-data</a> is an organization of climate scientists and computer scientists
that seeks to build tools useful to climate data analysis and that harness the
power of xarray + dask + dask.distributed.  We are actively seeking new users
and contributions; please see the Github page linked above for more information.
</p>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5">Python packages I have created</h3>
<div class="outline-text-3" id="text-orgheadline5">
</div><div id="outline-container-orgheadline3" class="outline-4">
<h4 id="orgheadline3"><code>aospy</code></h4>
<div class="outline-text-4" id="text-orgheadline3">
<p>
My colleagues and I often lament how much time we spend messing with computer
code in order to output data or figures.  Also, lacking sufficient metadata to
describe what they actually do/are, scripts/plots quickly become outdated and
untrustworthy (e. g. "Did I remember to change the output variable in the script
when I made this plot?").  In addition, creating plots one by one can be
impractical when dozens of plots are needed (e.g. DJF, JJA, SON, MAM, and annual
mean plots of multiple variables from multiple experimental runs and/or multiple
models and/or multiple ensemble members).
</p>

<p>
This frustrating inefficiency has led me to create a Python module that automates
these tasks. Dubbed "aospy", it's aim is to, given some dataset, perform all
frequently used calculations, create plots, and store all results and metadata
conveniently.  And do this all with minimal input by the user.
</p>

<p>
The source code for aospy is available on <a href="https://github.com/spencerahill">my Github</a>.  However, it is quite a
mess in its current state and very poorly documented.  I am working with Spencer
Clark of Princeton AOS to clean it up and create a proper v0.1 release
(someday&#x2026;).
</p>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4">Others: see <a href="https://github.com/spencerahill">my Github</a></h4>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6">Python packages I use</h3>
<div class="outline-text-3" id="text-orgheadline6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="http://xarray.pydata.org">xarray</a></td>
<td class="org-left">"N-D labeled arrays and datasets in Python"</td>
</tr>

<tr>
<td class="org-left"><a href="http://pandas.pydata.org/index.html">pandas</a></td>
<td class="org-left">"Easy-to-use data structures and data analysis tools"</td>
</tr>

<tr>
<td class="org-left"><a href="http://www.numpy.org/">NumPy</a></td>
<td class="org-left">N-dimensional arrays.</td>
</tr>

<tr>
<td class="org-left"><a href="http://scipy.org/">SciPy</a></td>
<td class="org-left">Extensive library for scientific computations</td>
</tr>

<tr>
<td class="org-left"><a href="http://unidata.github.io/netcdf4-python/">netcdf4-python</a></td>
<td class="org-left">Interface for netCDF files</td>
</tr>

<tr>
<td class="org-left"><a href="http://matplotlib.org/">matplotlib</a></td>
<td class="org-left">Plotting library that mimics MATLAB's commands</td>
</tr>

<tr>
<td class="org-left"><a href="http://matplotlib.org/basemap/">Basemap</a></td>
<td class="org-left">For plotting maps (part of Matplotlib)</td>
</tr>

<tr>
<td class="org-left"><a href="https://code.google.com/p/pyspharm/">pyspharm</a></td>
<td class="org-left">Python interface to SPHEREPACK library for spherical harmonic transforms</td>
</tr>

<tr>
<td class="org-left"><a href="http://ajdawson.github.io/windspharm/index.html">windspharm</a></td>
<td class="org-left">Wrapper for pyspharm</td>
</tr>

<tr>
<td class="org-left"><a href="https://pypi.python.org/pypi/colorama">colorama</a></td>
<td class="org-left">Colorize text outputted to terminal</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7">Python packages I haven't tried but look cool</h3>
<div class="outline-text-3" id="text-orgheadline7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="http://dask.pydata.org/en/latest/">Dask</a></td>
<td class="org-left">Parallel computing and memory chunking</td>
</tr>

<tr>
<td class="org-left"><a href="https://github.com/brian-rose/climlab">climlab</a></td>
<td class="org-left">"Python package for process-oriented climate modeling"</td>
</tr>

<tr>
<td class="org-left"><a href="http://xgcm.readthedocs.org/en/latest/">xgcm</a></td>
<td class="org-left">"General Circulation Model Postprocessing with xarray"</td>
</tr>

<tr>
<td class="org-left"><a href="http://matplotlib.org/cmocean/">cmocean</a></td>
<td class="org-left">"Beautiful colormaps for oceanography" (for matplotlib)</td>
</tr>

<tr>
<td class="org-left"><a href="http://mpld3.github.io/index.html">mpld3</a></td>
<td class="org-left">"Bringing matplotlib to the browser"</td>
</tr>

<tr>
<td class="org-left"><a href="http://www.clawpack.org/">Clawpack</a></td>
<td class="org-left">Finite volume methods for systems of conservation laws</td>
</tr>

<tr>
<td class="org-left"><a href="http://pint.readthedocs.org/en/0.6/">Pint</a></td>
<td class="org-left">Keep track of physical units in computations</td>
</tr>

<tr>
<td class="org-left"><a href="https://astropy.readthedocs.org/en/latest/units/index.html">astropy.units</a></td>
<td class="org-left">Keep track of physical units in computations</td>
</tr>

<tr>
<td class="org-left"><a href="http://stanford.edu/~mwaskom/software/seaborn/">Seaborn</a></td>
<td class="org-left">Visualization library with emphasis on statistical data</td>
</tr>

<tr>
<td class="org-left"><a href="http://scitools.org.uk/iris/">Iris</a></td>
<td class="org-left">"A Python library for meteorology and climatology"</td>
</tr>

<tr>
<td class="org-left"><a href="http://scitools.org.uk/cartopy/docs/latest/index.html">cartopy</a></td>
<td class="org-left">An alternative library to Basemap for plotting maps</td>
</tr>

<tr>
<td class="org-left"><a href="http://ioam.github.io/holoviews/index.html">HoloViews</a></td>
<td class="org-left">"Composable, declarative data structures for building even complex visualizations easily"</td>
</tr>

<tr>
<td class="org-left"><a href="http://ajdawson.github.io/eofs/">eofs</a></td>
<td class="org-left">Empirical Orthogonal Function analysis</td>
</tr>

<tr>
<td class="org-left"><a href="http://pynco.readthedocs.org/en/latest/">pynco</a></td>
<td class="org-left">Python wrapper for NCO command-line tools for netCDF data</td>
</tr>

<tr>
<td class="org-left"><a href="http://www.blogofile.com/">Blogofile</a></td>
<td class="org-left">Python-based engine for blogging (if/when I ever started a blog)</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8">Python environments and package managers</h3>
<div class="outline-text-3" id="text-orgheadline8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="https://www.python.org/">Python</a></td>
<td class="org-left">The official, bread-and-butter Python</td>
</tr>

<tr>
<td class="org-left"><a href="http://ipython.org/index.html">IPython</a></td>
<td class="org-left">"Interactive Python": more IDE-like Python environment</td>
</tr>

<tr>
<td class="org-left"><a href="http://ipython.org/notebook.html">IPython Notebook</a></td>
<td class="org-left">Amazing web-based interface for IPython</td>
</tr>

<tr>
<td class="org-left"><a href="https://store.continuum.io/cshop/anaconda/">Anaconda</a></td>
<td class="org-left">Great, free package manager</td>
</tr>

<tr>
<td class="org-left"><a href="https://www.enthought.com/products/canopy/">Canopy</a></td>
<td class="org-left">Another package manager; free for academic use</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9">Other Python resources</h3>
<div class="outline-text-3" id="text-orgheadline9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="https://talkpython.fm/">Talk Python To Me</a></td>
<td class="org-left">Great weekly podcast on Python</td>
</tr>

<tr>
<td class="org-left"><a href="https://pyformat.info/">PyFormat</a></td>
<td class="org-left">Simple, clear guide to understanding string formatting</td>
</tr>

<tr>
<td class="org-left"><a href="http://pydata.org/">PyData</a></td>
<td class="org-left">"A community for developers and users of Python data tools"</td>
</tr>

<tr>
<td class="org-left"><a href="http://earthpy.org/">EarthPy</a></td>
<td class="org-left">Misc. examples of python applications in earth sciences</td>
</tr>

<tr>
<td class="org-left"><a href="http://pyaos.johnny-lin.com/">PyAOS</a></td>
<td class="org-left">Collection of useful Python-related tools for AOS researchers</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12">Emacs &amp; Org-Mode</h2>
<div class="outline-text-2" id="text-orgheadline12">
</div><div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10">Overview</h3>
<div class="outline-text-3" id="text-orgheadline10">
<p>
<a href="https://www.gnu.org/software/emacs/emacs.html">Emacs</a> is a powerful text editor that I use for as many tasks as I can.  <a href="http://orgmode.org/">Org-mode</a>
is an extension of Emacs for creating outline-like documents, with many powerful
tools for embedding to-do lists, links, code, and images and for converting the
files to LaTeX, HTML, and other formats.
</p>

<p>
This integration of elements typically found in scientific manuscripts makes
Org-mode a potentially useful vehicle for <a href="http://reproducibleresearch.net/">reproducible research</a> &#x2013; try Googling
"org mode reproducible research" or checkout this <a href="https://www.youtube.com/watch?v=1-dUkyn_fZA&amp;list=FLQp2VLAOlvq142YN3JO3y8w">YouTube video</a> by John Kitchin,
a chemical engineering professor at Carnegie Mellon.  He also has a nice <a href="http://kitchingroup.cheme.cmu.edu/blog/2014/08/08/What-we-are-using-org-mode-for/">page</a>
highlighting the powers of Org-mode in reproducible research and beyond.
</p>

<p>
In fact, my website and CV are written entirely as org-mode files, which I then
publish to HTML (and PDF for the CV) using Org-Mode's Publish functionality.  I
intend to publish these source files on Github eventually as an example of how
Org-mode can be used.
</p>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11">Resources</h3>
<div class="outline-text-3" id="text-orgheadline11">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="https://emacsformacosx.com/">Emacs for Mac OS X</a></td>
<td class="org-left">Easily install GUI version of Emacs on Mac OS X/macOS</td>
</tr>

<tr>
<td class="org-left"><a href="https://github.com/purcell/exec-path-from-shell">exec-path-from-shell</a></td>
<td class="org-left">Library for linking environment variables that Emacs sees with your system values.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Especially useful for the GUI version of Emacs on OS X/macOS.</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13">Others</h2>
<div class="outline-text-2" id="text-orgheadline13">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="http://cremeronline.com/LaTeX/minimaltikz.pdf">A very minimal introduction to TikZ</a></td>
<td class="org-left">Great entry into \LaTeX{} plotting packages TikZ and PGF</td>
</tr>

<tr>
<td class="org-left"><a href="http://nco.sourceforge.net/">netCDF Operator (NCO) toolkit</a></td>
<td class="org-left">Library of command-line tools for interacting with netCDF data</td>
</tr>

<tr>
<td class="org-left"><a href="http://www.ohshitgit.com/">Oh shit, git!</a></td>
<td class="org-left">Accessible, humorous take on fixing common mistakes when using the <a href="https://git-scm.com/">git</a> version control system</td>
</tr>

<tr>
<td class="org-left"><a href="http://www.colordiff.org/">colordiff</a></td>
<td class="org-left">Colorize/prettify the <code>diff</code> command-line tool</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</body>
</html>
